app/views/questions/_question.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 18]]
---
    <ul class="answers">
        <% question.answers.each do |a| %>