app/controllers/submissions_controller.rb

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 14]]
---
  def show
    @submission = Submission.find(params[:id])

SELECT "questions".* FROM "questions"
---
  def new
    @questions = Question.all

INSERT INTO "submissions" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-03-07 09:38:28.652099"], ["updated_at", "2016-03-07 09:38:28.652099"]]
SELECT DISTINCT "questions"."id" FROM "questions"
UPDATE "submissions" SET "ip" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "submissions"."id" = ?  [["ip", "::1"], ["latitude", 0.0], ["longitude", 0.0], ["updated_at", "2016-03-07 09:38:28.688277"], ["id", 14]]
---
  def create
    @submission = Submission.create(submission_params)
    @submission.ip = request.remote_ip

    Question.uniq.pluck(:id).each do |qid|
      aid = params[qid.to_s]
      @submission.add_answer(aid)
    end

    if @submission.save